resources/e2eTestData.json

{
    "paymentModels": {
        "insertPaymentModel": {
            "merchantID": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "amount": 43,
            "initialPaymentAmount": 23,
            "trialPeriod": 23,
            "currency": "EUR",
            "numberOfPayments": 5,
            "frequency": 10,
            "typeID": 1,
            "networkID": 3,
            "automatedCashOut": false,
            "cashOutFrequency": 0
        },
        "updatePaymentModel": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "amount": 43,
            "initialPaymentAmount": 23,
            "trialPeriod": 23,
            "currency": "EUR",
            "numberOfPayments": 5,
            "typeID": 1,
            "frequency": 10,
            "networkID": 3,
            "automatedCashOut": true,
            "cashOutFrequency": 1
        }
    },
    "payments": {
        "insertTestPayment": {
            "pullPaymentModelID": "needed to be injected",
            "numberOfPayments": 4,
            "startTimestamp": 100,
            "customerAddress": "0x0000000000000000000000000000000000000000",
            "pullPaymentAddress": "0x0000000000000000000000000000000000000000",
            "userID": "2342934"
        },
        "updateTestPayment": {
            "id": "",
            "hdWalletIndex": 0,
            "numberOfPayments": 5,
            "nextPaymentDate": 10,
            "lastPaymentDate": 20,
            "startTimestamp": 100,
            "statusID": 1,
            "userID": "2342934"
        }
    }
}